var APP_DATA = {
  "scenes": [
    {
      "id": "0--18-20",
      "name": "Спаська 18-20",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 1.0740949073065185,
        "pitch": -0.0373324441863474,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 0.9379311454905999,
          "pitch": 0.1528802714052535,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": 1.8403287871313552,
          "pitch": 0.07911249990662128,
          "rotation": 0,
          "target": "4---"
        },
        {
          "yaw": 2.0642673517380796,
          "pitch": 0.019954372297011247,
          "rotation": 0,
          "target": "3-"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.6395829406682374,
          "pitch": -0.07646245053146217,
          "title": "Адреса",
          "text": "Спаська 18-20"
        }
      ]
    },
    {
      "id": "1--",
      "name": "тротуар (ліворуч)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 1.5742137547008994,
        "pitch": -0.0028761395728480466,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 1.6818498113563987,
          "pitch": 0.02876784712430691,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": 2.61971603281237,
          "pitch": 0.04309004626553481,
          "rotation": 0,
          "target": "4---"
        },
        {
          "yaw": 1.0853821460797128,
          "pitch": 0.18720653164551138,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": 3.1122939304090664,
          "pitch": -0.01609871463850432,
          "rotation": 0,
          "target": "3-"
        },
        {
          "yaw": 1.4519270012758723,
          "pitch": 0.06948117435130108,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": 2.127147232885954,
          "pitch": 0.04028969064954424,
          "rotation": 0,
          "target": "6----"
        },
        {
          "yaw": -0.20790714666489407,
          "pitch": 0.3519116703070466,
          "rotation": 0,
          "target": "0--18-20"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "2--",
      "name": "тротуар (центр)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 1.6804910742471364,
        "pitch": 0.026562300389702642,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 2.8798496209036157,
          "pitch": 0.4854868833454411,
          "rotation": 0,
          "target": "4---"
        },
        {
          "yaw": -2.2303247152926815,
          "pitch": 0.20433969671751662,
          "rotation": 0,
          "target": "3-"
        },
        {
          "yaw": 2.003354334544528,
          "pitch": 0.010890896053467714,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": 0.23225623400051632,
          "pitch": 0.45369142322557643,
          "rotation": 0,
          "target": "1--"
        },
        {
          "yaw": 1.3297940335208729,
          "pitch": 0.17216163291812947,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": 2.072073820655419,
          "pitch": 0.17637699303523746,
          "rotation": 0,
          "target": "6----"
        },
        {
          "yaw": 1.8578485211818272,
          "pitch": 0.08390822097258521,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": 1.5627235737532637,
          "pitch": 0.07204639827866366,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": 0.2583440428033832,
          "pitch": 0.2900041422863513,
          "rotation": 0,
          "target": "0--18-20"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.5458307043662618,
          "pitch": 0.4232328519434123,
          "title": "Оголошення",
          "text": "Text"
        },
        {
          "yaw": 2.1558690698475518,
          "pitch": 0.325950098185281,
          "title": "Оголошення",
          "text": "Text"
        },
        {
          "yaw": 2.841127912857454,
          "pitch": 0.08991121119612444,
          "title": "Оголошення",
          "text": "Text"
        }
      ]
    },
    {
      "id": "3-",
      "name": "парковка",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.49003475152148646,
        "pitch": 0.10421776334534982,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 0.06408175224816048,
          "pitch": 0.397246299984122,
          "rotation": 0,
          "target": "4---"
        },
        {
          "yaw": -0.2174573026457125,
          "pitch": 0.13709664699533164,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -0.0957177214144096,
          "pitch": 0.1445555332634214,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": 0.25472780254203187,
          "pitch": 0.19011876493864222,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -0.8975656738594999,
          "pitch": 0.18091030001124686,
          "rotation": 0,
          "target": "1--"
        },
        {
          "yaw": -0.5289020338232717,
          "pitch": 0.35060254852315964,
          "rotation": 0,
          "target": "2--"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.38994002790882654,
          "pitch": 0.30854304393283094,
          "title": "Оголошення",
          "text": "текст без уточнень"
        },
        {
          "yaw": -0.3251573301737487,
          "pitch": 0.20914251911961657,
          "title": "Оголошення",
          "text": "текст без уточнень"
        }
      ]
    },
    {
      "id": "4---",
      "name": "хвіртка (з вулиці)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.5987836317069846,
        "pitch": 0.1712148969245071,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.978208873123279,
          "pitch": 0.306043528556053,
          "rotation": 0,
          "target": "3-"
        },
        {
          "yaw": 0.21582231748768166,
          "pitch": 0.532974185505859,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": 0.4000844696478403,
          "pitch": 0.31087605014477404,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -0.15224527780209307,
          "pitch": 0.24139061400423856,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -0.012539716938761103,
          "pitch": 0.23503959065604008,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": 0.2269660850620312,
          "pitch": 0.2324128270767929,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -1.2602484219064856,
          "pitch": 0.21931387055755636,
          "rotation": 0,
          "target": "1--"
        },
        {
          "yaw": -1.2860352592449704,
          "pitch": 0.5794286866267377,
          "rotation": 0,
          "target": "2--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "5----",
      "name": "хвіртка (в на території)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.5732677104382091,
        "pitch": 0.11538395227520404,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 0.5335342223951418,
          "pitch": 0.4659200989218668,
          "rotation": 0,
          "target": "6----"
        },
        {
          "yaw": 0.531775695357922,
          "pitch": 0.3112886620465396,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -0.11454460365176189,
          "pitch": 0.2704215995424022,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -0.20580645220423577,
          "pitch": 0.20256625569585118,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -0.03538088269825401,
          "pitch": 0.19165346125334004,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": 0.18815629951202695,
          "pitch": 0.19293560503029994,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": 0.43110073314666586,
          "pitch": 0.22575827435374762,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -2.8937199133072156,
          "pitch": 0.3035919602706123,
          "rotation": 0,
          "target": "4---"
        },
        {
          "yaw": -2.9195058197326134,
          "pitch": 0.07159912754389097,
          "rotation": 0,
          "target": "3-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "6----",
      "name": "доріжка центральна (під вербою)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.3584637771403827,
        "pitch": 0.13957736162323187,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -3.086734319492221,
          "pitch": 0.15963068392021462,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -3.1086339389112894,
          "pitch": -0.003423939383310426,
          "rotation": 0,
          "target": "4---"
        },
        {
          "yaw": 0.22586360267382766,
          "pitch": 0.5387914680456376,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -0.6419922332506616,
          "pitch": 0.27716232840696087,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -0.5636835210336049,
          "pitch": 0.22572855241467948,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -0.37660153064355484,
          "pitch": 0.22269267374420743,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": 0.1952673589083016,
          "pitch": 0.322879140420703,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -0.001980649916005106,
          "pitch": 0.25168330105013226,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": 0.4846608407868658,
          "pitch": 0.27341710471489655,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": -0.13763206061879174,
          "pitch": 0.20238726067957202,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": -2.034671225077483,
          "pitch": -0.06700026469946607,
          "rotation": 0,
          "target": "1--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "7---",
      "name": "доріжка центральна (люки)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.38800066560980895,
        "pitch": 0.10049570036872879,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -3.129098569448283,
          "pitch": 0.054441496393090816,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -3.1234789712496465,
          "pitch": 0.4407366882857868,
          "rotation": 0,
          "target": "6----"
        },
        {
          "yaw": 0.21863992260745135,
          "pitch": 0.3673612296998847,
          "rotation": 0,
          "target": "9---5--"
        },
        {
          "yaw": 0.24471442780841102,
          "pitch": 0.5457118484856984,
          "rotation": 0,
          "target": "8---10--"
        },
        {
          "yaw": -0.866485451546307,
          "pitch": 0.1456219963689218,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -0.5891980110564177,
          "pitch": 0.1682410847567244,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -0.38216524292717935,
          "pitch": 0.19923906428850913,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -0.10399091271438721,
          "pitch": 0.21104249411046183,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": 0.4109443527762071,
          "pitch": 0.2520005237707661,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": 0.6891544860378627,
          "pitch": 0.2899064995486924,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": 0.07194952258534215,
          "pitch": 0.19645414168235753,
          "rotation": 0,
          "target": "22---"
        },
        {
          "yaw": -1.1605404934316415,
          "pitch": 0.23754627580683518,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -2.483705314244368,
          "pitch": -0.09406496793463326,
          "rotation": 0,
          "target": "1--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "8---10--",
      "name": "доріжка центральна (10м до сходів)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.367861703881891,
        "pitch": 0.08560744846224821,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 0.8673750234053443,
          "pitch": 0.3553161300420289,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": 0.24161317690375306,
          "pitch": 0.5290128170575468,
          "rotation": 0,
          "target": "9---5--"
        },
        {
          "yaw": -2.946168808983776,
          "pitch": 0.4615179221979133,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": 3.140852058700167,
          "pitch": -0.04730089389827796,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -3.0072779138390136,
          "pitch": 0.13702446082195152,
          "rotation": 0,
          "target": "6----"
        },
        {
          "yaw": 0.852857426692605,
          "pitch": 0.2159561383200348,
          "rotation": 0,
          "target": "18--"
        },
        {
          "yaw": 0.4142349088424204,
          "pitch": 0.3070816572317181,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": 0.7916522562218056,
          "pitch": 0.3067506596753624,
          "rotation": 0,
          "target": "14------"
        },
        {
          "yaw": -1.575213487449414,
          "pitch": 0.12875429268488858,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -1.1590648853980188,
          "pitch": 0.127774015435822,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -0.7760831714126422,
          "pitch": 0.1590496773961263,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -0.19785874111799018,
          "pitch": 0.2406533738193044,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -0.5287379415481261,
          "pitch": 0.2163632159504374,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -0.3764165243742319,
          "pitch": 0.16774776821016424,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": 0.024421484834491025,
          "pitch": 0.3705409355032945,
          "rotation": 0,
          "target": "10---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "9---5--",
      "name": "доріжка центральна (5м до сходів)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.1933338431553171,
        "pitch": 0.018610314883098056,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 2.829375601876082,
          "pitch": -0.0856826549679468,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": 2.973636183568681,
          "pitch": 0.0660320875557705,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": 0.7697892193206766,
          "pitch": 0.4460533351494753,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": 0.6299702161192489,
          "pitch": 0.2523362008884984,
          "rotation": 0,
          "target": "18--"
        },
        {
          "yaw": 0.8971146499316873,
          "pitch": 0.24972255115260644,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": -2.9440879836447564,
          "pitch": 0.6534711199250651,
          "rotation": 0,
          "target": "8---10--"
        },
        {
          "yaw": -0.5571509258187053,
          "pitch": 0.47534667270942776,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": 0.04636165790308233,
          "pitch": 0.3594909174707901,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": 0.5361416489709363,
          "pitch": 0.3746598915400128,
          "rotation": 0,
          "target": "14------"
        },
        {
          "yaw": -0.5723556587907837,
          "pitch": 0.31039346517826516,
          "rotation": 0,
          "target": "13--"
        },
        {
          "yaw": -2.3389815399646885,
          "pitch": -0.023201246138553344,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -1.7429472542568742,
          "pitch": 0.010337367334237513,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -1.3300064496536557,
          "pitch": 0.09556411875572479,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -1.0539284177199377,
          "pitch": 0.16619179958983388,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -0.7180502301292808,
          "pitch": 0.22204031210315378,
          "rotation": 0,
          "target": "25-----"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "10---",
      "name": "доріжка центральна (сходи)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.6446401722704902,
        "pitch": 0.05386289408841449,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -1.3210478063214381,
          "pitch": 0.07272559753453223,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -1.0564085770278062,
          "pitch": 0.15264774741893383,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -0.6098197186408694,
          "pitch": 0.23732061967973728,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -0.2337820754593487,
          "pitch": 0.2348976572559458,
          "rotation": 0,
          "target": "24----"
        },
        {
          "yaw": -1.7003450062178214,
          "pitch": 0.0031826887533519255,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -2.2698430920156927,
          "pitch": -0.04382798699333179,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": 2.099127656413481,
          "pitch": 0.2335565752702724,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -3.0489025766683397,
          "pitch": -0.00013078164166913098,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -3.1078644023648554,
          "pitch": -0.10487077433742797,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -3.036934917691589,
          "pitch": 0.2555594761359714,
          "rotation": 0,
          "target": "9---5--"
        },
        {
          "yaw": 1.7566217401711075,
          "pitch": 0.1413492883770573,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": 0.9274315885909612,
          "pitch": 0.5482298773587786,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": 0.7613560056996498,
          "pitch": 0.3750115009334465,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": 1.3092296678327529,
          "pitch": 0.2893201392561,
          "rotation": 0,
          "target": "14------"
        },
        {
          "yaw": -0.1639398502365026,
          "pitch": 0.43907018033332434,
          "rotation": 0,
          "target": "13--"
        },
        {
          "yaw": -0.5168857842115351,
          "pitch": 0.12827435532794595,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": -0.8498449904297072,
          "pitch": 0.11740335785719935,
          "rotation": 0,
          "target": "33---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "11---",
      "name": "центральний вхід (фасад)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.46702896440184816,
        "pitch": 0.2211145291973189,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.583940978392725,
          "pitch": 0.5733511667604461,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": -2.343683588599026,
          "pitch": 0.09771471813543187,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -3.0810523834134003,
          "pitch": 0.04482938518721724,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -2.6193570449246764,
          "pitch": -0.03712500521932327,
          "rotation": 0,
          "target": "8---10--"
        },
        {
          "yaw": -2.8093265944586587,
          "pitch": -0.10731417231128226,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -1.8537367979133528,
          "pitch": -0.05257427534125192,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -2.2899195961557215,
          "pitch": -0.09809193063051325,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -1.1461243820617497,
          "pitch": 0.11922800342774309,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": 2.040074016741279,
          "pitch": 0.09619992059138127,
          "rotation": 0,
          "target": "17----"
        },
        {
          "yaw": 2.0844866742758708,
          "pitch": 0.2962075048748414,
          "rotation": 0,
          "target": "14------"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.927658158424034,
          "pitch": 0.27788788596907565,
          "title": "Музей Гетьманства",
          "text": "Text"
        }
      ]
    },
    {
      "id": "12--",
      "name": "фасад (центр)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.0009192123776724515,
        "pitch": -0.0038225821240427393,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 0.2154554607316257,
          "pitch": 0.6519803580457353,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": -2.9338553623502843,
          "pitch": 0.18580226007509282,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": 2.4230593683956076,
          "pitch": 0.1715070687763145,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": 2.957091873711275,
          "pitch": 0.03777406901683378,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": 2.767947727237053,
          "pitch": -0.019417490654021208,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -2.474854733724488,
          "pitch": -0.007796467923151695,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -2.937022925733162,
          "pitch": -0.019044945284978354,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -2.2124294425410103,
          "pitch": -0.007065169333468901,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -1.6723566981328855,
          "pitch": 0.08959183189857,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": 1.6105113312269452,
          "pitch": 0.09896656418600536,
          "rotation": 0,
          "target": "16----"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "13--",
      "name": "фасад (ліворуч)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.8967717558958199,
        "pitch": -0.06550285908879516,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 3.062929802503014,
          "pitch": -0.161363183876837,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": 3.0693374984030495,
          "pitch": 0.10870056222343116,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": 2.451886984282794,
          "pitch": 0.0803160644615506,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": 2.037970693439763,
          "pitch": 0.3872306973710682,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": 1.2865873537031476,
          "pitch": 0.3909718035590597,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": -1.0026756102458787,
          "pitch": 0.22152282619651942,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -0.13396389000754994,
          "pitch": 0.27796964187452744,
          "rotation": 0,
          "target": "24----"
        },
        {
          "yaw": 0.11942196126925708,
          "pitch": 0.2606275987635307,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": -0.6687713064210534,
          "pitch": 0.09062698112586176,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": -1.755893640618913,
          "pitch": -0.07351817528742899,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -2.159641895768095,
          "pitch": -0.15248096268914324,
          "rotation": 0,
          "target": "28---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "14------",
      "name": "фасад (праворуч), табличка \"памятка архітектури\" ",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 0.10606231608272942,
        "pitch": 0.11910601525182685,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -0.834433205294463,
          "pitch": 0.3762289435852466,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": -1.1853985880606182,
          "pitch": 0.24346906503572363,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": -0.8948272169309206,
          "pitch": 0.16730906286241343,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -1.5942104309581353,
          "pitch": 0.049270081478296035,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -2.1099794967283554,
          "pitch": -0.04843789251756725,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -1.9312803018365194,
          "pitch": -0.09184511164343334,
          "rotation": 0,
          "target": "9---5--"
        },
        {
          "yaw": 2.6477794075617442,
          "pitch": -0.10892623927745859,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": 1.1298280156355673,
          "pitch": 0.2995585857755998,
          "rotation": 0,
          "target": "19----"
        },
        {
          "yaw": 1.8456535922096222,
          "pitch": 0.14370049212169533,
          "rotation": 0,
          "target": "17----"
        },
        {
          "yaw": -1.2208326314760107,
          "pitch": 0.04622188480644951,
          "rotation": 0,
          "target": "27---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "15---",
      "name": "урна та курилка",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.2564398063491158,
        "pitch": -0.08209519071917626,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 3.053961361176043,
          "pitch": 0.16116029957490952,
          "rotation": 0,
          "target": "9---5--"
        },
        {
          "yaw": 2.702008522556566,
          "pitch": 0.12206163368825784,
          "rotation": 0,
          "target": "8---10--"
        },
        {
          "yaw": 2.3299359317629387,
          "pitch": 0.08083914819747129,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": 2.082364838287436,
          "pitch": 0.04195076774110085,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": 0.13698892661142636,
          "pitch": 0.32539605665575877,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": -0.3877619262519598,
          "pitch": 0.22269514444563754,
          "rotation": 0,
          "target": "18--"
        },
        {
          "yaw": -1.3832517153873845,
          "pitch": 0.20304860320915274,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": -1.5694985727368262,
          "pitch": 0.3363447691933992,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": -0.6370069284757154,
          "pitch": 0.3856734453520261,
          "rotation": 0,
          "target": "14------"
        },
        {
          "yaw": -2.0197293166883057,
          "pitch": 0.08099493675150882,
          "rotation": 0,
          "target": "13--"
        },
        {
          "yaw": -2.599309715737963,
          "pitch": 0.17244278887319808,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": 3.0336649159511655,
          "pitch": -0.06268831218019244,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -2.9487919576991164,
          "pitch": -0.1033472911849902,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -2.6209869191944044,
          "pitch": -0.07171458609760961,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -2.021126588314374,
          "pitch": -0.09263199362335328,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": -2.2985340456620342,
          "pitch": -0.08219869342154595,
          "rotation": 0,
          "target": "33---"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.776131925837129,
          "pitch": 0.5594329121605455,
          "title": "урна",
          "text": "курити тут. і викидати недопалки лише сюди"
        },
        {
          "yaw": -0.6374549861262615,
          "pitch": 0.11238634936509939,
          "title": "охоронна табличка",
          "text": "Text"
        },
        {
          "yaw": -1.3449687157585402,
          "pitch": 0.05246412642766174,
          "title": "Музей Гетьманства",
          "text": "Text"
        }
      ]
    },
    {
      "id": "16----",
      "name": "доріжка обхідна (дальній правий)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.403213522277623,
        "pitch": -0.16453707805467843,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -1.0670624981538488,
          "pitch": 0.10442348236734134,
          "rotation": 0,
          "target": "20------2-"
        },
        {
          "yaw": -0.05243450595678745,
          "pitch": 0.537667410308277,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": -0.22455721408007356,
          "pitch": 0.4040134979600669,
          "rotation": 0,
          "target": "17----"
        },
        {
          "yaw": -0.6202672122570139,
          "pitch": 0.2858168799994587,
          "rotation": 0,
          "target": "18--"
        },
        {
          "yaw": -0.8973417360852096,
          "pitch": 0.18190382916522552,
          "rotation": 0,
          "target": "20------2-"
        },
        {
          "yaw": -3.0096526410105557,
          "pitch": 0.14600278578771686,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -3.135116494473383,
          "pitch": -0.011600469640004718,
          "rotation": 0,
          "target": "9---5--"
        },
        {
          "yaw": 2.8601152185204164,
          "pitch": -0.0337511103409458,
          "rotation": 0,
          "target": "8---10--"
        },
        {
          "yaw": -1.4317405492137265,
          "pitch": 0.3478103538487858,
          "rotation": 0,
          "target": "14------"
        },
        {
          "yaw": -2.1865209290724454,
          "pitch": 0.11155292808221873,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": -2.4012420216308534,
          "pitch": -0.00022466644992036322,
          "rotation": 0,
          "target": "13--"
        },
        {
          "yaw": -2.7534634241371094,
          "pitch": -0.13264843155236683,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -2.283445254569802,
          "pitch": -0.08644224983731696,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -3.032362783389873,
          "pitch": -0.13271450358986847,
          "rotation": 0,
          "target": "28---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "17----",
      "name": "доріжка обхідна (діагональний вигляд)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -0.9858046115797201,
        "pitch": -0.06158143797138749,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -0.14547924875919804,
          "pitch": 0.48300850367589554,
          "rotation": 0,
          "target": "18--"
        },
        {
          "yaw": -2.197612999329026,
          "pitch": 0.013492079314451288,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -2.402031113357646,
          "pitch": 0.6109207497454765,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": -2.3065308777180036,
          "pitch": -0.06892918709438689,
          "rotation": 0,
          "target": "9---5--"
        },
        {
          "yaw": -0.2770453481212307,
          "pitch": 0.3065620422984878,
          "rotation": 0,
          "target": "18--"
        },
        {
          "yaw": -0.4278417391142604,
          "pitch": 0.18538310321189222,
          "rotation": 0,
          "target": "20------2-"
        },
        {
          "yaw": -1.4434503999384791,
          "pitch": 0.25369859623317836,
          "rotation": 0,
          "target": "14------"
        },
        {
          "yaw": -1.6769561996011184,
          "pitch": 0.03943070174721974,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": -2.0269859412166866,
          "pitch": -0.028328102195210647,
          "rotation": 0,
          "target": "10---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "18--",
      "name": "доріжка обхідна",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -0.7140078594155881,
        "pitch": 0.12097487789014494,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.6185320301677404,
          "pitch": 0.12703044416191744,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": -2.0180013098725276,
          "pitch": 0.0193596416580597,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -1.8868650296451026,
          "pitch": -0.012474836153614888,
          "rotation": 0,
          "target": "9---5--"
        },
        {
          "yaw": 0.13521171250113007,
          "pitch": 0.5798017660868044,
          "rotation": 0,
          "target": "19----"
        },
        {
          "yaw": -0.028554230475787534,
          "pitch": 0.3249246159858181,
          "rotation": 0,
          "target": "20------2-"
        },
        {
          "yaw": 0.08985084864388249,
          "pitch": 0.42361044071616405,
          "rotation": 0,
          "target": "20------2-"
        },
        {
          "yaw": -2.6749574883471468,
          "pitch": 0.5199826368698872,
          "rotation": 0,
          "target": "17----"
        },
        {
          "yaw": -1.7228222554921935,
          "pitch": 0.035687172874224515,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -1.5077116408870097,
          "pitch": 0.10961967239594728,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": -1.5977936332032918,
          "pitch": 0.29405048633971376,
          "rotation": 0,
          "target": "14------"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "19----",
      "name": "доріжка обхідна (права сторона)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.0801495046029608,
        "pitch": -0.15924883128126766,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.1806226767353607,
          "pitch": -0.014301194717408094,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -2.759524780302254,
          "pitch": 0.03261734770194202,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": -2.652467814526103,
          "pitch": 0.42189299318870965,
          "rotation": 0,
          "target": "18--"
        },
        {
          "yaw": 0.09030186948391261,
          "pitch": 0.3556335239248867,
          "rotation": 0,
          "target": "20------2-"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "20------2-",
      "name": "доріжка обхідна (пожежні сходи на 2 поверх)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.2174869261993742,
        "pitch": -0.18981619842204012,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.6904946217289627,
          "pitch": 0.28889176291819574,
          "rotation": 0,
          "target": "19----"
        },
        {
          "yaw": -2.6576890060917933,
          "pitch": 0.07776136947545709,
          "rotation": 0,
          "target": "18--"
        },
        {
          "yaw": -2.513760046129061,
          "pitch": -0.06038117090428585,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": -2.1389963260646816,
          "pitch": -0.07780492948272055,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -0.43242175731158916,
          "pitch": 0.3262796068953584,
          "rotation": 0,
          "target": "21---"
        },
        {
          "yaw": -0.5348245907873181,
          "pitch": 0.17929241377478178,
          "rotation": 0,
          "target": "22---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "21---",
      "name": "вхід в підвал",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.294228768401947,
        "pitch": 0.1916809825782373,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.7971489627617956,
          "pitch": 0.10125390408280666,
          "rotation": 0,
          "target": "20------2-"
        },
        {
          "yaw": -2.4745898994730826,
          "pitch": -0.03709016547794519,
          "rotation": 0,
          "target": "19----"
        },
        {
          "yaw": 0.1615177197066,
          "pitch": 0.4451986117037947,
          "rotation": 0,
          "target": "22---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "22---",
      "name": "ліхтар позаду музея",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.6934458925946174,
        "pitch": -0.20440005857268773,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.8429714211761485,
          "pitch": 0.1202918979367773,
          "rotation": 0,
          "target": "21---"
        },
        {
          "yaw": -2.7009071031754033,
          "pitch": -0.08142900424074995,
          "rotation": 0,
          "target": "20------2-"
        },
        {
          "yaw": -0.6709236455471874,
          "pitch": 0.3087909735705541,
          "rotation": 0,
          "target": "24----"
        },
        {
          "yaw": -0.41126969715323725,
          "pitch": 0.2894876538838016,
          "rotation": 0,
          "target": "30---"
        },
        {
          "yaw": -0.13195704852965484,
          "pitch": 0.24590405044433794,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": 0.0468353650445561,
          "pitch": 0.516202262375959,
          "rotation": 0,
          "target": "23-----"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "23-----",
      "name": "доріжка обхідна (задній лівий кут)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.3809578326362804,
        "pitch": -0.27240973597834284,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.4822148400300232,
          "pitch": 0.206734346844744,
          "rotation": 0,
          "target": "22---"
        },
        {
          "yaw": -2.262598469221409,
          "pitch": -0.02848655954560897,
          "rotation": 0,
          "target": "21---"
        },
        {
          "yaw": -2.1333260078351017,
          "pitch": -0.14596430567836371,
          "rotation": 0,
          "target": "20------2-"
        },
        {
          "yaw": -0.587341669503191,
          "pitch": 0.3614876149231492,
          "rotation": 0,
          "target": "24----"
        },
        {
          "yaw": -0.5635836215172834,
          "pitch": 0.1960082323971939,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -0.3603106460727634,
          "pitch": 0.1688635912113554,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": 0.026537452816310036,
          "pitch": 0.39945541902406845,
          "rotation": 0,
          "target": "30---"
        },
        {
          "yaw": 0.3839371951316899,
          "pitch": 0.3490680680717926,
          "rotation": 0,
          "target": "31---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "24----",
      "name": "доріжка обхідна (ліва сторона)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.329011806403697,
        "pitch": -0.20657656898555743,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.786908978534157,
          "pitch": 0.07264741100779659,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": -2.44006809824573,
          "pitch": -0.02229969428480949,
          "rotation": 0,
          "target": "22---"
        },
        {
          "yaw": 1.7743753469197632,
          "pitch": 0.48343912460852323,
          "rotation": 0,
          "target": "30---"
        },
        {
          "yaw": 1.7802768228965018,
          "pitch": 0.23958271362267425,
          "rotation": 0,
          "target": "31---"
        },
        {
          "yaw": 1.8416643016889083,
          "pitch": 0.10920123407861837,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": 1.2368856638248271,
          "pitch": 0.25452903332584675,
          "rotation": 0,
          "target": "33---"
        },
        {
          "yaw": 0.07195860756526784,
          "pitch": 0.3854640785497736,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -0.35313130879282184,
          "pitch": 0.2497965599274714,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -0.27547105939783734,
          "pitch": 0.17041416618016036,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": 0.41966631421296796,
          "pitch": 0.28118761327511343,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": 0.07993388482833552,
          "pitch": 0.22639553188114192,
          "rotation": 0,
          "target": "29---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "25-----",
      "name": "доріжка обхідна (фасад дальній лівий)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -2.26295542328932,
        "pitch": -0.3287513242210309,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -0.9908936844604384,
          "pitch": 0.21285262556495432,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -1.509018963345083,
          "pitch": 0.13052624139995395,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": -1.7486852733951075,
          "pitch": 0.08176367602091439,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": -1.1602104214090545,
          "pitch": 0.11760481575807269,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -0.6032458602870836,
          "pitch": 0.15580755838553628,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": 0.49982487533831055,
          "pitch": 0.3713952605502211,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": 0.2283863187961206,
          "pitch": 0.30335789897540266,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -0.15402334247521843,
          "pitch": 0.25363085260195106,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -1.4797884526896858,
          "pitch": -0.006206822223081332,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": -3.0644725822167462,
          "pitch": -0.060614670475466426,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": 2.6682679003306484,
          "pitch": 0.09392562788263348,
          "rotation": 0,
          "target": "30---"
        },
        {
          "yaw": 2.3760148051404784,
          "pitch": 0.07816317954015517,
          "rotation": 0,
          "target": "31---"
        },
        {
          "yaw": 2.089343939755068,
          "pitch": 0.06637372471623415,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": 1.5733486265372871,
          "pitch": 0.2441216783200666,
          "rotation": 0,
          "target": "33---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "26--",
      "name": "доріжка діагональна",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -2.6979420671062204,
        "pitch": -0.20388633860816263,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 0.25463819735296767,
          "pitch": 0.5228283833741472,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -0.1874372008350793,
          "pitch": 0.3613258513568738,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -0.6443498806305286,
          "pitch": 0.22502576935938912,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -1.0531952282605026,
          "pitch": 0.07340452355501448,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -1.7203448283047234,
          "pitch": 0.0065179587852775,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -2.414763841858367,
          "pitch": -0.10877055068482733,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": -2.1734159376210958,
          "pitch": -0.0515384496510336,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": -1.9994312486195032,
          "pitch": -0.15219985331778396,
          "rotation": 0,
          "target": "16----"
        },
        {
          "yaw": -2.7926079106433352,
          "pitch": 0.24995725880165942,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": 2.880628869322969,
          "pitch": -0.07237752308081191,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": 3.079126305378007,
          "pitch": 0.051943329121531434,
          "rotation": 0,
          "target": "24----"
        },
        {
          "yaw": 2.5491226850429163,
          "pitch": 0.055811034973247686,
          "rotation": 0,
          "target": "30---"
        },
        {
          "yaw": 1.94667632662666,
          "pitch": 0.08735235760600091,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": 2.270349887855714,
          "pitch": 0.0838457067818883,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": 1.6400405662915016,
          "pitch": 0.3081584523643137,
          "rotation": 0,
          "target": "33---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "27---",
      "name": "доріжка діагональна (дерево)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -2.566992433629567,
        "pitch": -0.20809788781397032,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -0.4828413955757682,
          "pitch": 0.416091381371686,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -0.9194321630097058,
          "pitch": 0.18068101278291238,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -1.151606638703365,
          "pitch": 0.03354949696371179,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -2.342823090810498,
          "pitch": -0.06816883392723128,
          "rotation": 0,
          "target": "12--"
        },
        {
          "yaw": -1.9382353971187296,
          "pitch": -0.061290608524153356,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -2.92362222363127,
          "pitch": 0.014308697037808571,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": 3.0432488523206143,
          "pitch": -0.0655515139372973,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": 2.2972467618745345,
          "pitch": 0.040335207061819034,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": 2.156293427648359,
          "pitch": 0.2641736437451776,
          "rotation": 0,
          "target": "33---"
        },
        {
          "yaw": 2.824085555085704,
          "pitch": -0.0016716267488323666,
          "rotation": 0,
          "target": "30---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "28---",
      "name": "доріжка діагональна (береза)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.5413826436895839,
        "pitch": -0.12667020775269933,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -0.12371907915857605,
          "pitch": 0.24317975234925449,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -1.04377732158515,
          "pitch": 0.07938562541712813,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -0.48091684419889624,
          "pitch": 0.2228918360027201,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -0.29131006312281116,
          "pitch": 0.24167122889223158,
          "rotation": 0,
          "target": "6----"
        },
        {
          "yaw": -0.8740298016154089,
          "pitch": 0.15626341158797175,
          "rotation": 0,
          "target": "8---10--"
        },
        {
          "yaw": -1.2454889423215203,
          "pitch": -0.009865548733010598,
          "rotation": 0,
          "target": "18--"
        },
        {
          "yaw": -2.5375221680226296,
          "pitch": 0.14013023034896221,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -2.1650649825258377,
          "pitch": 0.02038446668607463,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -1.9806943891307505,
          "pitch": -0.038679039400102866,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -2.0702533847674633,
          "pitch": -0.13909701571932942,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": -2.691661336531542,
          "pitch": -0.15790938776235208,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": -2.279714716838267,
          "pitch": -0.12508161500996273,
          "rotation": 0,
          "target": "30---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "29---",
      "name": "доріжка діагональна (центр)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.388208035817014,
        "pitch": -0.20110087317794267,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 0.29667349592837056,
          "pitch": 0.3154363806800937,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": 0.0048103877136576045,
          "pitch": 0.3531660002163335,
          "rotation": 0,
          "target": "6----"
        },
        {
          "yaw": -0.9463174396831668,
          "pitch": 0.08995869653067956,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": -0.8368850797328129,
          "pitch": 0.1969566634741966,
          "rotation": 0,
          "target": "8---10--"
        },
        {
          "yaw": -2.7375404184207284,
          "pitch": 0.04964955707090013,
          "rotation": 0,
          "target": "28---"
        },
        {
          "yaw": -2.507923093802736,
          "pitch": -0.08283377312160667,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -2.2283935759980427,
          "pitch": -0.09128575350155188,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -1.9647429841411324,
          "pitch": -0.0898283875907353,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -1.8345239868894616,
          "pitch": -0.14385589058603188,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": -0.42517094319223325,
          "pitch": 0.30078817052217666,
          "rotation": 0,
          "target": "7---"
        },
        {
          "yaw": -2.3789277083949827,
          "pitch": -0.2027363765196739,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": -1.342153059321415,
          "pitch": -0.0086577322430621,
          "rotation": 0,
          "target": "11---"
        },
        {
          "yaw": -1.0578133910037657,
          "pitch": 0.0037094802068793342,
          "rotation": 0,
          "target": "18--"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "30---",
      "name": "доріжка дальня (початок)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": 2.9596657978016356,
        "pitch": -0.1316430875515877,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 1.8391592117461029,
          "pitch": 0.23660335686429512,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": 2.9192377313956834,
          "pitch": 0.2795977801996923,
          "rotation": 0,
          "target": "24----"
        },
        {
          "yaw": -2.361780132496209,
          "pitch": 0.040872871358050844,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -1.8340418373119647,
          "pitch": 0.004432020791627522,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -2.374176431101988,
          "pitch": -0.14152088499671223,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -2.7642246153742196,
          "pitch": -0.12901374589913495,
          "rotation": 0,
          "target": "15---"
        },
        {
          "yaw": 2.007686210066307,
          "pitch": 0.12159327993498437,
          "rotation": 0,
          "target": "22---"
        },
        {
          "yaw": -0.23094585740927442,
          "pitch": 0.25506899829545837,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": -0.18274485166016952,
          "pitch": 0.6170815117669797,
          "rotation": 0,
          "target": "31---"
        },
        {
          "yaw": -1.135353518900402,
          "pitch": 0.18138166355820573,
          "rotation": 0,
          "target": "33---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "31---",
      "name": "доріжка дальня (середина)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -2.891197049599974,
        "pitch": -0.15397090946085257,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": 0.0460143402030031,
          "pitch": 0.5067809708539439,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": -2.88674149733788,
          "pitch": 0.2702645033374722,
          "rotation": 0,
          "target": "30---"
        },
        {
          "yaw": -2.9516033946563365,
          "pitch": -0.05586927676267628,
          "rotation": 0,
          "target": "24----"
        },
        {
          "yaw": -2.2525004597624676,
          "pitch": -0.056787139363667194,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -1.7095300396758262,
          "pitch": 0.007418245968658255,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": 2.5560401216836297,
          "pitch": -0.03488593086300362,
          "rotation": 0,
          "target": "23-----"
        },
        {
          "yaw": -2.0779451188084153,
          "pitch": -0.15209962101967633,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -2.4613018035891496,
          "pitch": -0.18449462488595003,
          "rotation": 0,
          "target": "15---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "32---",
      "name": "доріжка дальня (кінець)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -2.1134346361977148,
        "pitch": -0.07714879893756432,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -2.3893483483978706,
          "pitch": 0.231046455884929,
          "rotation": 0,
          "target": "31---"
        },
        {
          "yaw": -2.428783909125487,
          "pitch": -0.04598194808232847,
          "rotation": 0,
          "target": "30---"
        },
        {
          "yaw": -1.9576934273279054,
          "pitch": -0.0828498824085333,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -1.6336365729932218,
          "pitch": -0.030321348270872406,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -1.3440105487887735,
          "pitch": 0.024009818167982644,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -1.5458044449783088,
          "pitch": -0.0841285935026157,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -1.7630414414891327,
          "pitch": -0.11922388118218841,
          "rotation": 0,
          "target": "6----"
        },
        {
          "yaw": -2.9950608107950902,
          "pitch": -0.1419942634764464,
          "rotation": 0,
          "target": "22---"
        }
      ],
      "infoHotspots": []
    },
    {
      "id": "33---",
      "name": "доріжка середня (середина)",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1440,
      "initialViewParameters": {
        "yaw": -1.3961413505988194,
        "pitch": 0.016072544671775546,
        "fov": 1.3715802068843215
      },
      "linkHotspots": [
        {
          "yaw": -0.10118336372031145,
          "pitch": 0.3235253975256107,
          "rotation": 0,
          "target": "27---"
        },
        {
          "yaw": -0.635694288351786,
          "pitch": 0.28084218506993075,
          "rotation": 0,
          "target": "26--"
        },
        {
          "yaw": -1.1168414314482327,
          "pitch": 0.17856687744634314,
          "rotation": 0,
          "target": "25-----"
        },
        {
          "yaw": -2.1826150811516953,
          "pitch": 0.051799960920742905,
          "rotation": 0,
          "target": "30---"
        },
        {
          "yaw": -1.860871201412321,
          "pitch": 0.031470477947891595,
          "rotation": 0,
          "target": "24----"
        },
        {
          "yaw": -2.136204075533101,
          "pitch": -0.06795285328209921,
          "rotation": 0,
          "target": "22---"
        },
        {
          "yaw": 2.963766535824961,
          "pitch": 0.04837135011749538,
          "rotation": 0,
          "target": "32---"
        },
        {
          "yaw": -2.7566419300052996,
          "pitch": 0.062451791086129305,
          "rotation": 0,
          "target": "31---"
        },
        {
          "yaw": -0.385897939349249,
          "pitch": 0.16170946440593603,
          "rotation": 0,
          "target": "5----"
        },
        {
          "yaw": -0.19515018637540393,
          "pitch": 0.22336661684469128,
          "rotation": 0,
          "target": "29---"
        },
        {
          "yaw": -0.7970868275535175,
          "pitch": 0.14809737588556082,
          "rotation": 0,
          "target": "10---"
        },
        {
          "yaw": -1.2221644969005627,
          "pitch": 0.07261519852552212,
          "rotation": 0,
          "target": "11---"
        }
      ],
      "infoHotspots": []
    }
  ],
  "name": "getman-museum.kiev.ua 201908xx",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": true,
    "viewControlButtons": true
  }
};
